# LAB Unit 2 - Day 5 (Connecting Python to SQL)

`Question` Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

`Question`

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

In [7]:
def rentals_month(engine, month, year):
    
    # SQL query
    
    query = f'SELECT * FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};'
    
    # Loading data into a Pandas DataFrame
    
    rental_data = pd.read_sql_query(query, engine)
    
    return rental_data

df= rentals_month(engine,0o2,2006)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,11496,2006-02-14 15:16:03,2047,155,None,1,2006-02-15 21:30:53
1,11541,2006-02-14 15:16:03,2026,335,None,1,2006-02-15 21:30:53
2,11563,2006-02-14 15:16:03,1545,83,None,1,2006-02-15 21:30:53
3,11577,2006-02-14 15:16:03,4106,219,None,2,2006-02-15 21:30:53
4,11593,2006-02-14 15:16:03,817,99,None,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
177,15862,2006-02-14 15:16:03,925,215,None,1,2006-02-15 21:30:53
178,15867,2006-02-14 15:16:03,837,505,None,2,2006-02-15 21:30:53
179,15875,2006-02-14 15:16:03,3611,41,None,1,2006-02-15 21:30:53
180,15894,2006-02-14 15:16:03,4416,168,None,1,2006-02-15 21:30:53
181,15966,2006-02-14 15:16:03,4472,374,None,1,2006-02-15 21:30:53

In [ ]:
#I KEEP THIS AS A NOTHE (THIS SQL QUERY BELOW DID NOT WORKED)

#query = 'SELECT * date_format(rental_date, '%M') AS month, date_format(rental_date,'%y') AS year FROM sakila.rental'

# data = pd.read_sql_query(, engine)
# data.head()

`Question`
Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [5]:
def rental_count_month(rentals_month, month, year):
    df=rentals_month
    df2=df.groupby(['customer_id']).count()
    df2=df2.drop(columns=['rental_date', 'inventory_id', 'return_date', 'staff_id', 'last_update'])
    df2 = df2.rename(columns={'rental_id':f'rentals_{month}_{year}'})
    return df2.reset_index()

df2= rental_count_month(df, 0o2, 2006)
df2

     customer_id  rentals_2_2006
0              5               1
1              9               1
2             11               1
3             14               1
4             15               2
..           ...             ...
153          587               1
154          590               1
155          592               1
156          596               1
157          597               1

[158 rows x 2 columns]

`Question` Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [6]:
df1= rentals_month(engine,0o5,2005)
df1= rental_count_month(df1, 0o5, 2005)

df2= rentals_month(engine,0o6,2005)
df2= rental_count_month(df2, 0o6, 2005)

def compare_rentals (df1, df2):
    merge_df = pd.merge(df1, df2, on='customer_id')
    merge_df['difference'] = merge_df.iloc[:,2] - merge_df.iloc[:,1]
    return merge_df

df3 = compare_rentals(df1,df2)
df3

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1               2               7           5
1              2               1               1           0
2              3               2               4           2
3              5               3               5           2
4              6               3               4           1
..           ...             ...             ...         ...
507          594               4               6           2
508          595               1               2           1
509          596               6               2          -4
510          597               2               3           1
511          599               1               4           3

[512 rows x 4 columns]